# ColorDepth Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
PrintParameters..::..ColorDepth Property
PrintParameters Class See Also
---
The color depth type.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public ColorDepthType ColorDepth { get; set; }
```

Visual Basic
---
```text
Public Property ColorDepth As ColorDepthType
	Get
	Set
```

Visual C++
---
```text
public:
property ColorDepthType ColorDepth {
	ColorDepthType get ();
	void set (ColorDepthType value);
}
```

# See Also
PrintParameters Class
Autodesk.Revit.DB Namespace